
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
		// регистр ОстаткиТоваров Приход
		Движения.ОстаткиТоваров.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;     
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Проведен " + Ссылка);
		Сообщение.Сообщить();

  КонецПроцедуры
  
  #КонецОбласти
