
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Восстановить(Команда)
	ВосстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГраницуПоТекДокументу(Команда) 
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьГраницуПоТекДокументуНаСервере(ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПрочитатьГраницуНаСервере()

	Граница = Последовательности.СкладскиеДокументы.ПолучитьГраницу();
	ГраницаДата = Граница.Дата;
	ГраницаСсылка = Граница.Ссылка;	
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНаСервере()

	Последовательности.СкладскиеДокументы.Восстановить();
	ПрочитатьГраницуНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьГраницуПоТекДокументуНаСервере(ДокументСсылка)
			
	МоментВремениДокумента = ДокументСсылка.МоментВремени();   
	Последовательности.СкладскиеДокументы.УстановитьГраницу(МоментВремениДокумента);
	
КонецПроцедуры

#КонецОбласти

