
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записать();
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура); 
		
		Остатки = РегистрыНакопления.ОстаткиТоваров.Остатки(Дата, Отбор);  
		
		Если Остатки.Количество() = 0 Тогда		
			ТекстСообщения = СтрШаблон("Недостаточно товара %1. товара нет на складе", ТекСтрокаТовары.Номенклатура);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = (ТекстСообщения);
			Сообщение.Сообщить(); 
			Отказ = Истина;
			Продолжить;  			
		КонецЕсли; 
		
		СтрокаОстатка = Остатки[0];
		Если СтрокаОстатка.Количество < ТекСтрокаТовары.Количество Тогда
			ТекстСообщения = СтрШаблон("Недостаточно товара %1. Не Хватает %2", ТекСтрокаТовары.Номенклатура, (ТекСтрокаТовары.Количество - СтрокаОстатка.Количество));
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = (ТекстСообщения);
			Сообщение.Сообщить();  
			Отказ = Истина;
			Продолжить;  			
		КонецЕсли; 
			
		СуммаКСписанию = 0; 
		
		Если ТекСтрокаТовары = СтрокаОстатка.Количество Тогда  
			СуммаКСписанию = СтрокаОстатка.Сумма;
		Иначе		
		СтоимостьЕдиницыТовара = СтрокаОстатка.Сумма / СтрокаОстатка.Количество; 
		СуммаКСписанию = СтоимостьЕдиницыТовара * ТекСтрокаТовары.Количество;  
	КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = СуммаКСписанию;
	КонецЦикла;  
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Проведен " + Ссылка);
	Сообщение.Сообщить(); 

КонецПроцедуры

#КонецОбласти

